export const jsQuizz = {
  questions: [
    {
      question: "တစ်ကုဋေမှာ သုညဘယ်နှစ်လုံးပါဝင်သည်နည်း",
      choices: ["၆", "၇", "၈", "၉"],
      type: "MCQs",
      correctAnswer: "၇",
    },
    {
      question: "လူ့ခနွာကိုယ်မှာ အသေးဆုံးအရိုးက ဘယ်နေရာမှာရှိပါလဲ",
      choices: ["နှာခေါင်း", "ဒူး", "လက်သန်း", "နား"],
      type: "MCQs",
      correctAnswer: "နား",
    },
    {
      question: "သက္ကရာဇ် ၁၈၈၅ခုနှစ်ကို ရာစုနှစ်နဲ့ ပြောပါက ",
      choices: ["၁၇ရာစု ", "၁၈ရာစု", "၁၉ရာစု", "၂၀ရာစု"],
      type: "MCQs",
      correctAnswer: "၁၉ရာစု",
    },
    {
      question: "အရှည်ဆုံးကမ်းခြေကိုပိုင်ဆိုင်သော နိုင်ငံမှာ ",
      choices: ["ကနေဒါ", "အမေရိကန်", "ဂျပန်", "ဩစတေးလျ"],
      type: "MCQs",
      correctAnswer: "ကနေဒါ",
    },
    {
      question: "ကမ္ဘာ့လေထုထဲမှာ အများဆုံးပါဝင်နေသော ဓာတ်ငွေ့မှာ",
      choices: [
        "အောက်ဆီဂျင်",
        "နိုက်ထရိုဂျင်",
        "ကာပွန်ဒိုင်အောက်ဆိုဒ်",
        "ဟိုက်ဒရိုဂျင်",
      ],
      type: "MCQs",
      correctAnswer: "နိုက်ထရိုဂျင်",
    },
    {
      question:
        "နေရောင်ခြည်နှင့် ထိတွေ့တဲ့အခါမှာ လူ့ခနွာကိုယ်က ဘာ ဗီတာမင်ဓာတ် ကိုထုတ်ပေးသနည်း",
      choices: ["ဗီတာမင် A", "ဗီတာမင် B", "ဗီတာမင် C", "ဗီတာမင် D"],
      type: "MCQs",
      correctAnswer: "ဗီတာမင် D",
    },
    {
      question:
        "ကမ္ဘာ့အမြင့်ဆုံးရေတံခွန် (Angel Fall) သည် မည်သည့်နိုင်ငံတွင်တည်ရှိသနည်း",
      choices: ["ကိုလံဘီယာ", "တရုတ်", "ဘရာဇီး", "ဗင်နီဇွဲလား"],
      type: "MCQs",
      correctAnswer: "ဗင်နီဇွဲလား",
    },
    {
      question: "နေစကြာဝဠာတွင် အကြီးဆုံးဂြိုလ်မှာ ",
      choices: ["ကမ္ဘာဂြိုလ်", "စေတန်ဂြိုလ်", "ဂျူပီတာဂြိုလ်", "ပလူတိုဂြိုလ်"],
      type: "MCQs",
      correctAnswer: "ဂျူပီတာဂြိုလ်",
    },
    {
      question: "အံစာတုံး တတုံးတွင် အစက်ပေါင်းမည်မျှပါသနည်း",
      choices: ["၂၀စက်", "၂၁စက်", "၂၂စက်", "၂၃စက်"],
      type: "MCQs",
      correctAnswer: "၂၁စက်",
    },
    {
      question:
        "အင်္ဂလိပ်ခရစ်နှစ် ပြက္ခဒိန်တွင် ရက်ပေါင်း၃၀တိတိ ရှိသောလ မည်မျှရှိသနည်း",
      choices: ["၄လ", "၅လ", "၆လ", "၇လ"],
      type: "MCQs",
      correctAnswer: "၄လ",
    },
  ],

  questions2: [
    {
      question: "ကုန်းဘောင်မင်းဆက်တွင် အသက်အရှည်ဆုံး ဘုရင်မှာ",
      choices: ["ဆင်ဖြူရှင်မင်း", "ဘကြီးတော်", "ဗဒုံမင်း", "ပုဂံမင်း"],
      type: "MCQs",
      correctAnswer: "ဗဒုံမင်း",
    },

    {
      question: "စစ်သူကြီး မဟာဗန္ဒုလရဲ့ ငယ်နာမည်မှာ",
      choices: ["မောင်ရစ်", "မောင်စံ", "မောင်ပေါ်", "မောင်သျှံ"],
      type: "MCQs",
      correctAnswer: "မောင်ရစ်",
    },

    {
      question: "ကမ္ဘောဇသာဒီ နန်းတော်ကို တည်ထောင်စေသူမှာ",
      choices: ["အလောင်းမင်းတရား", "မဟာဗန္ဒုလ", "ဘုရင့်နောင်", "ကျန်စစ်သား"],
      type: "MCQs",
      correctAnswer: "ဘုရင့်နောင်",
    },
    {
      question:
        "အမေရိကန် သမ္မတ james Buchanan ထံ သဝဏ်လွှာ ပေးပို့ခဲ့သော မင်းမှာ မည်သူဖြစ်သနည်း",
      choices: ["သာဝတီမင်း", "ပုဂံမင်း", "မင်တုန်းမင်း", "သီပေါမင်း"],
      type: "MCQs",
      correctAnswer: "၁၉၂၀",
    },

    {
      question: "အင်းဝ- ဟံသာဝတီ စစ်ပွဲကြာချိန်မှာ",
      choices: ["အနှစ် ၃၀", "အနှစ် ၄၀", "အနှစ် ၅၀", "အနှစ် ၆၀"],
      type: "MCQs",
      correctAnswer: "အနှစ် ၄၀",
    },
    {
      question: "ဘိုးတော်ဘုရားခေါ် ဗဒုံမင်း၏ ဖခင်မှာ",
      choices: [
        "သာဝတီမင်း",
        "ဖောင်းကားစားမောင်မောင်",
        "အလောင်းမင်းတရား",
        "စဉ့်ကူးမင်း",
      ],
      type: "MCQs",
      correctAnswer: "အလောင်းမင်းတရား",
    },
    {
      question: "မြစေတီ ကျောက်စာကို ရေးထိုးခဲ့သူမှာ",
      choices: ["ကျန်စစ်သား", "ရာဇကုမာရ်", "မိဖုရား ဖွားစော", "ဘမ္ဘူလ"],
      type: "MCQs",
      correctAnswer: "ရာဇကုမာရ်",
    },
    {
      question: "ရွှေဂူကြီးဘုရားကို တည်ထားသူမှာ",
      choices: ["ကျန်စစ်သား", "အလောင်းစည်သူ", "အနော်ရထာ", "ပုဂံမင်း"],
      type: "MCQs",
      correctAnswer: "အလောင်းစည်သူ",
    },
    {
      question: "ရွှေဂူကြီးဘုရားကို တည်ထားသူမှာ",
      choices: ["ကျန်စစ်သား", "အလောင်းစည်သူ", "အနော်ရထာ", "ပုဂံမင်း"],
      type: "MCQs",
      correctAnswer: "အလောင်းစည်သူ",
    },
  ],
  questions3: [
    {
      question: "ဂျပန်ခေတ် မြန်မာနိင်ငံ၏ အဓိပတိမှာ",
      choices: [
        "ဗိုလ်ချုပ်အောင်ဆန်း",
        "‌ဒေါက်တာဘမော်",
        "ဦးစော",
        "သခင်ကိုယ်တော်မှိုင်း",
      ],
      type: "MCQs",
      correctAnswer: "ဒေါက်တာဘမော်",
    },
    {
      question: "မြန်မာ့ပထမဆုံး အလင်္ကာကျော်စွာဘွဲ့ရရှိသူမှာ",
      choices: [
        "မြို့မငြိမ်း",
        "‌ရွှေမန်းတင်မောင်",
        "နန်းတော်ရှေ့ဆရာတင်",
        "သခင်ကိုယ်တော်မှိုင်း",
      ],
      type: "MCQs",
      correctAnswer: "သခင်ကိုယ်တော်မှိုင်း",
    },
    {
      question: "မြန်မာ့ပထမဆုံး အလင်္ကာကျော်စွာဘွဲ့ရရှိသူမှာ",
      choices: [
        "မြို့မငြိမ်း",
        "‌ရွှေမန်းတင်မောင်",
        "နန်းတော်ရှေ့ဆရာတင်",
        "သခင်ကိုယ်တော်မှိုင်း",
      ],
      type: "MCQs",
      correctAnswer: "သခင်ကိုယ်တော်မှိုင်း",
    },
    {
      question: "မြန်မာပြည်ကိုအပြီးတိုင််လွတ်လပ်ရေးပေးသည့် စာချုပ်မှာ",
      choices: [
        "အောင်ဆန်းအက်တလီစာချုပ်",
        "‌ပင်လုံစာချုပ်",
        "နု-အက်တလီစာချုပ်",
        "ရန္တပိုစာချုပ်",
      ],
      type: "MCQs",
      correctAnswer: "နု-အက်တလီစာချုပ်",
    },
    {
      question: "မန္တလေးမြို့၏ ရှေးဟောင်းအမည်မှာ",
      choices: ["ရတနာပုံ", "‌အမရပူရ", "ဇေယျာရွှေမြေ", "တောင်သာ"],
      type: "MCQs",
      correctAnswer: "ရတနာပုံ",
    },
    {
      question: "မြန်မာနိင်ငံ၏အရှည်ဆုံးတူးမြောင်းမှာ ",
      choices: [
        "တွံ့တေးတူးမြောင်း",
        "ပဲခူးစစ်တောင်းတူးမြောင်း",
        "စူးအက်တူးမြောင်း",
        "ကျိုက်ထိုတူး‌မြောင်း",
      ],
      type: "MCQs",
      correctAnswer: "ပဲခူးစစ်တောင်းတူးမြောင်း",
    },
    {
      question: "မြန်မာ့ပထမဆုံး အင်္ဂလိပ်-မြန်မာ အဘိဓာန်ကို ပြုစုသူမှာ",
      choices: ["မက္ခရာမင်းသားကြီး", "ဦးဖေမောင်တင်", "မြန်မာစာအဖွဲ့", "ဦးနု"],
      type: "MCQs",
      correctAnswer: "မက္ခရာမင်းသားကြီး",
    },
    {
      question: "မြန်မာနိုင်ငံ၏အကြီးဆုံးကြီးမှာ",
      choices: [
        "ကိုကိုးကျွန်း",
        "ရမ်းဗြဲကျွန်း",
        "ဘီလူးကျွန်း",
        "ဂေါ်ရင်ဂျီကျွန်း",
      ],
      type: "MCQs",
      correctAnswer: "ရမ်းဗြဲကျွန်း",
    },
    {
      question:
        "မြန်မာနိုင်ငံတွင် အကြီးဆုံးအိုင်ဖြစ်သော အင်းတော်ကြီးအိုင်သည် မည်သည့်ဒေသတ္ငင်တည်ရှိသနည်း",
      choices: ["ကချင်ပြည်နယ်", "ရှမ်းပြည်နယ်", "ချင်းပြည်နယ်", "ကရင်ပြည်နယ်"],
      type: "MCQs",
      correctAnswer: "ကချင်ပြည်နယ်",
    },
    {
      question: "မြန်မာနိုင်ငံ၏အကြီးဆုံးကြီးမှာ",
      choices: [
        "ကိုကိုးကျွန်း",
        "ရမ်းဗြဲကျွန်း",
        "ဘီလူးကျွန်း",
        "ဂေါ်ရင်ဂျီကျွန်း",
      ],
      type: "MCQs",
      correctAnswer: "ရမ်းဗြဲကျွန်း",
    },
  ],

  questions:[
    {
      question:
                "မြန်မာ့ပထမဆုံးသော ရုပ်ရှင်ဇာတ်ကားအမည်မှာ မည်သည်ဖြစ်သနည်း",
              choices: [
                "ကျေးတောသူ မနု",
                "‌မေတ္တာနှင့် သူရာ",
                "ရွှေပေးလို့မရ",
                "ရတနာပုံ",
              ],
              type: "MCQs",
              correctAnswer: "မေတ္တာနှင့် သူရာ",
            },
      {
      question:
                "မြန်မာ့ပထမဆုံးရုပ်ရှင်၏ ဇာတ်ညွှန်းရေးသားသူမှာ မည်သူဖြစ်သနည်း",
              choices: [
                "သခင်ကိုယ်တော်မှိုင်း",
                "‌ဖိုးပါကြီး",
                "ပီမိုးနင်း",
                "ဆရာဇော်ဂျီ",
              ],
              type: "MCQs",
              correctAnswer: "ပီမိုးနင်း",
            },
        {  
      question:
                "တွံတေးသိန်းတန် ပထမဆုံး ပါဝင်သရုပ်ဆောင်ခဲ့သော ရုပ်ရှင်မှာ",
              choices: [
                "ပန်းနွယ်ကစိမ်း",
                "‌ချစ်ရက်ကယ်နှောင်း",
                "အမေ့ပါးက သနပ်ခါး",
                "ထွေးညို",
              ],
              type: "MCQs",
              correctAnswer: "ထွေးညို",
            },
        {  
      question:
                "ပထမဆုံးအကြိမ် ကလေးသရုတ်ဆောင်ဆုရရှိခဲ့သူမှာ",
              choices: [
                "ဝင်းမာ",
                "‌အောင်ထွန်းလေး",
                " ယွန်းယွန်း",
                "အင်္ဂလန်စိန်",
              ],
              type: "MCQs",
              correctAnswer: "ဝင်းမာ",
            },
          {
      question:
                "မြန်မာ့ရုပ်ရှင်ထူးချွန်ဆု အများဆုံးရရှိထားသော သရုပ်ဆောင်မှာ",
              choices: [
                "ရန်အောင်",
                "‌ကျော်ဟိန်း",
                " ကျောက်လုံး",
                "ပြေတီဦး",
              ],
              type: "MCQs",
              correctAnswer: "ရန်အောင်",
            },
          {
      question:
                "အကယ်ဒမီ အိန္ဒြာကျော်ဇင်သည် မြန်မာ့ရုပ်ရှင်ထူးချွန်ဆု မည်မျှရရှိခဲ့သနည်း",
              choices: [
                "၂ဆု",
                "‌၃ဆု",
                " ၄ဆု",
                "၅ဆု",
              ],
              type: "MCQs",
              correctAnswer: "၃ဆု",
            },
          {
      question:
                "အောက်ဖော်ပြပါ ဇာတ်ကားများထဲမှ ပြေတီဦးအကယ်ဒမီရရှိခဲ့သော ဇာတ်ကားကို ဖော်ပြပါ",
              choices: [
                "ဂုဏ်ရှိန်ပြင်းတဲ့ ချစ်ခြင်း သိက္ခာ",
                "‌ရင်ဘတ်ထဲကဓား",
                "စကားပြောသော အသည်းနှလုံး",
                "နှလုံးသားဖြင့် ပြုလုပ်သည်",
              ],
              type: "MCQs", 
              correctAnswer: "နှလုံးသားဖြင့် ပြုလုပ်သည်",
            },
      
          {
      question:
                "၂၀၁၈ ခုနှစ်တွင် ရုပ်ရှင်တသက်တာဆု ရရှိခဲ့သူမှာ မည်သူနည်း",
              choices: [
                "စည်သူ မြင့်မြင့်ခင်",
                "စည်သူ ‌ဗိုလ်ကလေးတင့်အောင်",
                "စည်သူ နွဲ့နွဲ့စန်း",
                "စည်သူဦးအောင်မြင့်မြတ်",
              ],
              type: "MCQs", 
              correctAnswer: "စည်သူ မြင့်မြင့်ခင်",
            },
          {
      question:
                "ချစ်လှစွာသောအမုန်းဇာတ်ကားဖြင့် အမျိုးသမီးဇာတ်ဆောင်ဆု ရရှိခဲံ့သူမှာ မည်သူနည်း",
              choices: [
                "သက်မွန်မြင့်",
                "ဝတ်မှုန်ရွှေရည်",
                "ဖွေးဖွေး",
                "ခိုင်သင်းကြည်",
              ],
              type: "MCQs", 
              correctAnswer: "သက်မွန်မြင့်",
            },
          
          
  ]
};

export const resultInitalState = {
  score: 0,
  correctAnswers: 0,
  wrongAnswers: 0,
};
